tutorials/combustion/XiDyMFoam/annularCombustorTurbine/Allrun
#!/bin/sh

cd ${0%/*} || exit 1

. $WM_PROJECT_DIR/bin/tools/RunFunctions

./Allrun.mesh

restore0Dir

runApplication decomposePar -force

runParallel potentialFoam -pName pPotential -initialiseUBCs

\rm -f processor*/0/phi

runParallel XiDyMFoam
